{
    "name": "testpolicy",
    "description": "",
    "platforms": "windows10",
    "technologies": "mdm",
    "roleScopeTagIds": [
        "0"
    ],
    "settings": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_policiesoptions",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "value": "device_vendor_msft_policy_config_applicationcontrol_configure_xml_selected",
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_applicationcontrol_policies_{policyguid}_xml",
                            "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "value": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<SiPolicy xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" PolicyType=\"Base Policy\" xmlns=\"urn:schemas-microsoft-com:sipolicy\">\r\n\t<VersionEx>10.0.0.3</VersionEx>\r\n\t<PlatformID>{2E07F7E4-194C-4D20-B7C9-6F44A6C5A234}</PlatformID>\r\n\t<PolicyID>{488E7D72-DA1E-4219-BB58-22EEBCBB2CFE}</PolicyID>\r\n\t<BasePolicyID>{488E7D72-DA1E-4219-BB58-22EEBCBB2CFE}</BasePolicyID>\r\n\t<Rules>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Unsigned System Integrity Policy</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Advanced Boot Options Menu</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:UMCI</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Inherit Default Policy</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Update Policy No Reboot</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Allow Supplemental Policies</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Managed Installer</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Revoked Expired As Unsigned</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Required:Enforce Store Applications</Option>\r\n\t\t</Rule>\r\n\t\t<Rule>\r\n\t\t\t<Option>Enabled:Audit Mode</Option>\r\n\t\t</Rule>\r\n\t</Rules>\r\n\t<EKUs>\r\n\t\t<EKU ID=\"ID_EKU_STORE\" Value=\"010A2B0601040182374C0301\" FriendlyName=\"Windows Store EKU - 1.3.6.1.4.1.311.76.3.1 Windows Store\" />\r\n\t</EKUs>\r\n\t<FileRules>\r\n\t\t<FileAttrib ID=\"ID_FILEATTRIB_REFRESH_POLICY_0_0\" FriendlyName=\"RefreshPolicy.exe FileAttribute\" FileName=\"RefreshPolicy.exe\" MinimumFileVersion=\"10.0.19042.0\" />\r\n\t\t<Deny ID=\"ID_DENY_PATH_0_0_1_0_0\" FriendlyName=\"Deny by path: *\\winget.exe\" FilePath=\"*\\winget.exe\" />\r\n\t</FileRules>\r\n\t<Signers>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftProductRoot1997\" ID=\"ID_SIGNER_MICROSOFT_PRODUCT_1997_0_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"04\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftProductRoot2001\" ID=\"ID_SIGNER_MICROSOFT_PRODUCT_2001_1_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"05\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftProductRoot2010\" ID=\"ID_SIGNER_MICROSOFT_PRODUCT_2010_2_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"06\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftStandardRoot2011\" ID=\"ID_SIGNER_MICROSOFT_STANDARD_2011_3_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"07\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftCodeVerificationRoot2006\" ID=\"ID_SIGNER_MICROSOFT_CODEVERIFICATION_2006_4_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"08\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftDMDRoot2005\" ID=\"ID_SIGNER_DRM_5_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"0C\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftFlightRoot2014\" ID=\"ID_SIGNER_MICROSOFT_FLIGHT_2014_6_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"0E\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftTestRoot2010\" ID=\"ID_SIGNER_TEST2010_7_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"0A\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftProductRoot1997\" ID=\"ID_SIGNER_MICROSOFT_PRODUCT_1997_UMCI_8_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"04\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftProductRoot2001\" ID=\"ID_SIGNER_MICROSOFT_PRODUCT_2001_UMCI_9_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"05\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftProductRoot2010\" ID=\"ID_SIGNER_MICROSOFT_PRODUCT_2010_UMCI_10_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"06\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftStandardRoot2011\" ID=\"ID_SIGNER_MICROSOFT_STANDARD_2011_UMCI_11_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"07\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftCodeVerificationRoot2006\" ID=\"ID_SIGNER_MICROSOFT_CODEVERIFICATION_2006_UMCI_12_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"08\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftDMDRoot2005\" ID=\"ID_SIGNER_DRM_UMCI_13_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"0C\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftFlightRoot2014\" ID=\"ID_SIGNER_MICROSOFT_FLIGHT_2014_UMCI_14_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"0E\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"Microsoft MarketPlace PCA 2011\" ID=\"ID_SIGNER_STORE_15_0\">\r\n\t\t\t<CertRoot Type=\"TBS\" Value=\"FC9EDE3DCCA09186B2D3BF9B738A2050CB1A554DA2DCADB55F3F72EE17721378\" />\r\n\t\t\t<CertEKU ID=\"ID_EKU_STORE\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"Microsoft Code Signing PCA 2011\" ID=\"ID_SIGNER_MICROSOFT_REFRESH_POLICY_16_0\">\r\n\t\t\t<CertRoot Type=\"TBS\" Value=\"F6F717A43AD9ABDDC8CEFDDE1C505462535E7D1307E630F9544A2D14FE8BF26E\" />\r\n\t\t\t<CertPublisher Value=\"Microsoft Corporation\" />\r\n\t\t\t<FileAttribRef RuleID=\"ID_FILEATTRIB_REFRESH_POLICY_0_0\" />\r\n\t\t</Signer>\r\n\t\t<Signer Name=\"MincryptKnownRootMicrosoftTestRoot2010\" ID=\"ID_SIGNER_TEST2010_UMCI_17_0\">\r\n\t\t\t<CertRoot Type=\"Wellknown\" Value=\"0A\" />\r\n\t\t</Signer>\r\n\t</Signers>\r\n\t<SigningScenarios>\r\n\t\t<SigningScenario ID=\"ID_SIGNINGSCENARIO_DRIVERS_1\" FriendlyName=\"Auto generated policy on 11-22-2024\" Value=\"131\">\r\n\t\t\t<ProductSigners>\r\n\t\t\t\t<AllowedSigners>\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_PRODUCT_1997_0_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_PRODUCT_2001_1_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_PRODUCT_2010_2_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_STANDARD_2011_3_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_CODEVERIFICATION_2006_4_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_DRM_5_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_FLIGHT_2014_6_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_TEST2010_7_0\" />\r\n\t\t\t\t</AllowedSigners>\r\n\t\t\t</ProductSigners>\r\n\t\t</SigningScenario>\r\n\t\t<SigningScenario ID=\"ID_SIGNINGSCENARIO_WINDOWS\" FriendlyName=\"Auto generated policy on 11-22-2024\" Value=\"12\">\r\n\t\t\t<ProductSigners>\r\n\t\t\t\t<AllowedSigners>\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_PRODUCT_1997_UMCI_8_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_PRODUCT_2001_UMCI_9_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_PRODUCT_2010_UMCI_10_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_STANDARD_2011_UMCI_11_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_CODEVERIFICATION_2006_UMCI_12_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_DRM_UMCI_13_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_FLIGHT_2014_UMCI_14_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_STORE_15_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_MICROSOFT_REFRESH_POLICY_16_0\" />\r\n\t\t\t\t\t<AllowedSigner SignerId=\"ID_SIGNER_TEST2010_UMCI_17_0\" />\r\n\t\t\t\t</AllowedSigners>\r\n\t\t\t\t<FileRulesRef>\r\n\t\t\t\t\t<FileRuleRef RuleID=\"ID_DENY_PATH_0_0_1_0_0\" />\r\n\t\t\t\t</FileRulesRef>\r\n\t\t\t</ProductSigners>\r\n\t\t</SigningScenario>\r\n\t</SigningScenarios>\r\n\t<UpdatePolicySigners />\r\n\t<CiSigners>\r\n\t\t<CiSigner SignerId=\"ID_SIGNER_STORE_15_0\" />\r\n\t\t<CiSigner SignerId=\"ID_SIGNER_MICROSOFT_REFRESH_POLICY_16_0\" />\r\n\t</CiSigners>\r\n\t<HvciOptions>1</HvciOptions>\r\n\t<Settings>\r\n\t\t<Setting Provider=\"PolicyInfo\" Key=\"Information\" ValueName=\"Name\">\r\n\t\t\t<Value>\r\n\t\t\t\t<String>Base-Allow-Microsoft-B03</String>\r\n\t\t\t</Value>\r\n\t\t</Setting>\r\n\t\t<Setting Provider=\"PolicyInfo\" Key=\"Information\" ValueName=\"Id\">\r\n\t\t\t<Value>\r\n\t\t\t\t<String>2024-03-21</String>\r\n\t\t\t</Value>\r\n\t\t</Setting>\r\n\t\t<Setting Provider=\"AllHostIds\" Key=\"{0468C085-CA5B-11D0-AF08-00609797F0E0}\" ValueName=\"EnterpriseDefinedClsId\">\r\n\t\t\t<Value>\r\n\t\t\t\t<Boolean>true</Boolean>\r\n\t\t\t</Value>\r\n\t\t</Setting>\r\n\t</Settings>\r\n</SiPolicy>",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "88f6f096-dedb-4cf1-ac2f-4b41e303adb5"
                                }
                            },
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "4d709667-63d7-42f2-8e1b-b780f6c3c9c7"
                            }
                        }
                    ],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "b28c7dc4-c7b2-4ce2-8f51-6ebfd3ea69d3"
                    }
                },
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "1de98212-6949-42dc-a89c-e0ff6e5da04b"
                }
            }
        }
    ],
    "templateReference": {
        "templateId": "4321b946-b76b-4450-8afd-769c08b16ffc_1"
    }
}
